# Titanic Dataset

**Import pandas as pd.**

In [2]:
#importing pandas library
import pandas as pd

**Read titanic dataset.csv.**

In [3]:
#loading data
titanic = pd.read_csv('D:/titanic dataset.csv')

**Check the head of the DataFrame.**

In [4]:
# View first five rows of the dataset
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Use the .isnull() method to find out ho null values.**

In [5]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

The columns having null values are: Age, Cabin, Embarked. They need to be filled up with appropriate values later on.

-----------------------------------------------------------------------------------

**Use the .info() method to find out how many entries there are.**

In [6]:
titanic.info() # 891 Entries

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

The training-set has 891 rows and 11 features + the target variable (survived). 2 of the features are floats, 5 are integers and 5 are objects.

--------------------------------------------------

**What percentage of the Pclass's survive?**

In [8]:
titanic[['Pclass', 'Survived']].groupby(['Pclass'], as_index=False).mean().sort_values(by='Survived', ascending=False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363

 Class 1 passengers have a higher survival chance compared to classes 2 and 3. It implies that Pclass contributes a lot to a passenger’s survival rate.

-------------------------------------------

**Percentage of women and men alive?**

In [9]:
titanic[["Sex", "Survived"]].groupby(['Sex'], as_index=False).mean().sort_values(by='Survived', ascending=False)

      Sex  Survived
0  female  0.742038
1    male  0.188908

As previously mentioned, women are much more likely to survive than men. 74% of the women survived, while only 18% of men survived.

----------------------------------------------------------

**The ship's captain**

In [10]:
titanic[titanic['Name'].str.contains("Capt")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0,B22,S

"The captain goes down with the ship" is a maritime tradition that a sea captain holds ultimate responsibility for both his/her ship and everyone embarked on it, and that in an emergency, he/she will either save them or die trying.

----------------------------

**What is the most surviving age group?**

In [11]:
titanic[titanic['Age']<18].groupby(['Sex','Pclass']).mean()

               PassengerId  Survived        Age     SibSp     Parch  \
Sex    Pclass
female 1        525.375000  0.875000  14.125000  0.500000  0.875000
       2        369.250000  1.000000   8.333333  0.583333  1.083333
       3        374.942857  0.542857   8.428571  1.571429  1.057143
male   1        526.500000  1.000000   8.230000  0.500000  2.000000
       2        527.818182  0.818182   4.757273  0.727273  1.000000
       3        437.953488  0.232558   9.963256  2.069767  1.000000

                     Fare
Sex    Pclass
female 1       104.083337
       2        26.241667
       3        18.727977
male   1       116.072900
       2        25.659473
       3        22.752523

Children below 18 years of age have higher chances of surviving.

---------------------

# Thanks